zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_adc_ex.c
        tmp_hal_status = HAL_ERROR;
      }
      else
      {
        CLEAR_BIT(hadc->Instance->CFGR1, ADC_CFGR1_JAUTO);
      }
    }

    if (pConfigInjected->InjecOversamplingMode == ENABLE)
    {
      assert_param(IS_ADC_OVERSAMPLING_RATIO(pConfigInjected->InjecOversampling.Ratio));
      assert_param(IS_ADC_RIGHT_BIT_SHIFT(pConfigInjected->InjecOversampling.RightBitShift));

      /*  JOVSE must be reset in case of triggered regular mode  */
      assert_param(!(READ_BIT(hadc->Instance->CFGR2, ADC_CFGR2_ROVSE | ADC_CFGR2_TROVS) ==
                     (ADC_CFGR2_ROVSE | ADC_CFGR2_TROVS)));

      /* Configuration of Injected Oversampler:                                 */
      /*  - Oversampling Ratio                                                  */
      /*  - Right bit shift                                                     */

      /* Enable OverSampling mode */
      MODIFY_REG(hadc->Instance->CFGR2,
                 ADC_CFGR2_JOVSE |
                 ADC_CFGR2_OVSR  |
                 ADC_CFGR2_OVSS,
                 ADC_CFGR2_JOVSE                                  |
                 ((pConfigInjected->InjecOversampling.Ratio - 1UL)  << ADC_CFGR2_OVSR_Pos) |
                 pConfigInjected->InjecOversampling.RightBitShift
                );
    }
    else
    {
      /* Disable Regular OverSampling */
      CLEAR_BIT(hadc->Instance->CFGR2, ADC_CFGR2_JOVSE);
    }

    /* Set sampling time of the selected ADC channel */
    LL_ADC_SetChannelSamplingTime(hadc->Instance, pConfigInjected->InjectedChannel,
                                  pConfigInjected->InjectedSamplingTime);

    /* Configure the offset: offset enable/disable, channel, offset value */

    /* Shift the offset with respect to the selected ADC resolution. */
    /* Offset has to be left-aligned on bit 11, the LSB (right bits) are set to 0 */
    tmpOffsetShifted = ADC_OFFSET_SHIFT_RESOLUTION(hadc, pConfigInjected->InjectedOffset);

    if (pConfigInjected->InjectedOffsetNumber != ADC_OFFSET_NONE)
    {
      /* Set ADC selected offset number */
      LL_ADC_SetOffsetChannel(hadc->Instance, pConfigInjected->InjectedOffsetNumber, pConfigInjected->InjectedChannel);
      LL_ADC_SetOffsetLevel(hadc->Instance, pConfigInjected->InjectedOffsetNumber, tmpOffsetShifted);

      assert_param(IS_ADC_OFFSET_SIGN(pConfigInjected->InjectedOffsetSign));
      assert_param(IS_FUNCTIONAL_STATE(pConfigInjected->InjectedOffsetSignedSaturation));
      assert_param(IS_FUNCTIONAL_STATE(pConfigInjected->InjectedOffsetSaturation));
      /* Signed and unsigned saturation cannot be set at the same time */
      assert_param(!((pConfigInjected->InjectedOffsetSignedSaturation == ENABLE)
                     && (pConfigInjected->InjectedOffsetSaturation == ENABLE)));

      /* Set ADC selected offset sign  */
      LL_ADC_SetOffsetSign(hadc->Instance, pConfigInjected->InjectedOffsetNumber, pConfigInjected->InjectedOffsetSign);
      /* Set ADC selected offset signed saturation */
      LL_ADC_SetOffsetSignedSaturation(hadc->Instance, pConfigInjected->InjectedOffsetNumber,
                                       (pConfigInjected->InjectedOffsetSignedSaturation == ENABLE)
                                       ? LL_ADC_OFFSET_SIGNED_SATURATION_ENABLE                       \
                                       : LL_ADC_OFFSET_SIGNED_SATURATION_DISABLE);
      /* Set ADC offset unsigned saturation */
      LL_ADC_SetOffsetUnsignedSaturation(hadc->Instance, pConfigInjected->InjectedOffsetNumber, \
                                         (pConfigInjected->InjectedOffsetSaturation == ENABLE)  \
                                         ? LL_ADC_OFFSET_UNSIGNED_SATURATION_ENABLE             \
                                         : LL_ADC_OFFSET_UNSIGNED_SATURATION_DISABLE);
    }
    else
    {
      /* Scan each offset register to check if the selected channel is targeted. */
      /* If this is the case, the corresponding offset number is disabled.       */
      /* Scan each offset register to check if the selected channel is targeted.
         If this is the case, the corresponding offset number is disabled.       */
      if (LL_ADC_GetOffsetChannel(hadc->Instance, LL_ADC_OFFSET_1) == pConfigInjected->InjectedChannel)
      {
        LL_ADC_SetOffsetLevel(hadc->Instance, LL_ADC_OFFSET_1, 0UL);
      }
      if (LL_ADC_GetOffsetChannel(hadc->Instance, LL_ADC_OFFSET_2) == pConfigInjected->InjectedChannel)
      {
        LL_ADC_SetOffsetLevel(hadc->Instance, LL_ADC_OFFSET_2, 0UL);
      }
      if (LL_ADC_GetOffsetChannel(hadc->Instance, LL_ADC_OFFSET_3) == pConfigInjected->InjectedChannel)
      {
        LL_ADC_SetOffsetLevel(hadc->Instance, LL_ADC_OFFSET_3, 0UL);
      }
      if (LL_ADC_GetOffsetChannel(hadc->Instance, LL_ADC_OFFSET_4) == pConfigInjected->InjectedChannel)
      {
        LL_ADC_SetOffsetLevel(hadc->Instance, LL_ADC_OFFSET_4, 0UL);
      }
    }

  }

  /* Parameters update conditioned to ADC state:                              */
  /* Parameters that can be updated only when ADC is disabled:                */
  /*  - Single or differential mode                                           */
  /*  - Internal measurement channels: Vbat/VrefInt/TempSensor                */
  if (LL_ADC_IsEnabled(hadc->Instance) == 0UL)
  {
    /* Set mode single-ended or differential input of the selected ADC channel */
    LL_ADC_SetChannelSingleDiff(hadc->Instance, pConfigInjected->InjectedChannel, pConfigInjected->InjectedSingleDiff);

    /* Configuration of differential mode */
    /* Note: ADC channel number masked with value "0x1F" to ensure shift value within 32 bits range */
    if (pConfigInjected->InjectedSingleDiff == ADC_DIFFERENTIAL_ENDED)
    {
      /* Set sampling time of the selected ADC channel */
      LL_ADC_SetChannelSamplingTime(hadc->Instance,
                                    (uint32_t)(__LL_ADC_DECIMAL_NB_TO_CHANNEL(\
                                                                              (__LL_ADC_CHANNEL_TO_DECIMAL_NB(\
                                                                                  (uint32_t)pConfigInjected\
                                                                                  ->InjectedChannel) + 1UL)\
                                                                              & 0x1FUL)), \
                                    pConfigInjected->InjectedSamplingTime);
    }

